## Init & version check

In [1]:
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn

print('numpy: {}'.format(np.__version__))
print('pandas: {}'.format(pd.__version__))
print('matplotlib: {}'.format(matplotlib.__version__))
print('seaborn: {}'.format(sns.__version__))
print('scikit-learn: {}'.format(sklearn.__version__))

numpy: 1.16.5
pandas: 0.25.1
matplotlib: 3.1.1
seaborn: 0.9.0
scikit-learn: 0.21.3

## Titanic Data DL

In [ ]:
import pandas as pd
import numpy as np
 
# train data
train = pd.read_csv('https://github.com/kotaronov27/KaggleSB/Titanic/data/train.csv')
# org create
train_org = train.copy()
train.head()

In [3]:
# test data
test = pd.read_csv('https://github.com/kotaronov27/KaggleSB/Titanic/data/test.csv')
# org create
test_org = test.copy()
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
# test data
gendersb = pd.read_csv('https://github.com/kotaronov27/KaggleSB/Titanic/data/gender_submission.csv')
# org create
gendersb_org = gendersb.copy()
gendersb.head()